app/Controllers/Buku.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        $builder = $this->buku;
        $builder->select('
            buku.*,
            kategori.nama_kategori,
            penulis.nama_penulis,
            penerbit.nama_penerbit,
            rak.nama_rak,
            rak.lokasi
        ');
        $builder->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left');
        $builder->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left');
        $builder->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left');
        $builder->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left');
        $builder->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left');

        if ($keyword) {
            $builder->like('buku.judul', $keyword);
        }

        $data['buku'] = $builder->paginate(10);
---
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`

    public function create()
    {
        $data['kategori'] = $this->db->table('kategori')->get()->getResultArray();
        $data['penulis'] = $this->db->table('penulis')->get()->getResultArray();
        $data['penerbit'] = $this->db->table('penerbit')->get()->getResultArray();
---
SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`

    public function store()
    {
        // VALIDASI
        $rules = [
            'judul' => 'required',
            'cover' => 'max_size[cover,2048]|ext_in[cover,jpg,jpeg,png,pdf]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'Validasi gagal');
        }

        $data = $this->request->getPost();

        // HANDLE UPLOAD COVER
        $file = $this->request->getFile('cover');

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $namaFile = $file->getRandomName();
            $file->move('uploads/buku/', $namaFile);
            $data['cover'] = $namaFile;
        }

        $this->buku->insert($data);
        $id_buku = $this->buku->getInsertID();

        $this->db->table('buku_rak')->insert([
            'id_buku' => $id_buku,
            'id_rak' => $data['id_rak']
        ]);
---
INSERT INTO `buku` (`judul`, `isbn`, `id_kategori`, `id_penulis`, `id_penerbit`, `tahun_terbit`, `jumlah`, `tersedia`, `deskripsi`, `cover`) VALUES ('99 Kisah Azab Indosiar - Best Seller', '2333', '1', '1', '1', '2005', '20', '20', 'Itulah', '1791181005_81b4ec01bd9a96dc94fb.jpg')
INSERT INTO `buku_rak` (`id_buku`, `id_rak`) VALUES (4, '2')