app/Controllers/Peminjaman.php

SELECT *
FROM `buku`
WHERE `tersedia` > 0
SELECT *
FROM `pengaturan`
 LIMIT 1
---
    public function create()
    {
        $session = session();
        $data['buku'] = $this->buku->where('tersedia >', 0)->findAll();
        $data['petugas'] = $this->petugas->getAllWithUser();
        $data['pengaturan'] = $this->pengaturan->first();

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '3'
---
    public function store()
    {
        $session = session();
        $validation = \Config\Services::validation();
        $validation->setRules([
            'id_buku'       => 'required',
            'tanggal_pinjam' => 'required',
            'tanggal_kembali' => 'required',
        ]);

        if ($session->get('role') !== 'anggota') {
            $validation->setRules([
                'id_anggota'    => 'required',
            ]);
        }

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->with('error', implode('<br>', $validation->getErrors()))->withInput();
        }

        $buku = $this->buku->find($this->request->getPost('id_buku'));

INSERT INTO `peminjaman` (`id_anggota`, `id_petugas`, `id_buku`, `tanggal_pinjam`, `tanggal_kembali`, `status`) VALUES ('1', '1', '3', '2026-10-05', '2026-10-12', 'dipinjam')
UPDATE `buku` SET `tersedia` = 5
WHERE `buku`.`id_buku` IN ('3')
---
            'status'         => $status,
        ];

        $this->peminjaman->save($data);

        // Kurangi stok hanya jika status dipinjam (bukan dimohon)
        if ($status === 'dipinjam') {
            $this->buku->update($data['id_buku'], ['tersedia' => $buku['tersedia'] - 1]);

SELECT *
FROM `buku`
---
    public function edit($id)
    {
        $session = session();
        $peminjaman = $this->peminjaman->getPeminjamanWithRelations($id);

        if (!$peminjaman) {
            return redirect()->to('/peminjaman')->with('error', 'Data tidak ditemukan');
        }

        // Anggota hanya bisa edit peminjaman miliknya
        if ($session->get('role') === 'anggota') {
            $anggotaData = $this->anggota->getByUserId($session->get('id'));
            if ($anggotaData && $peminjaman['id_anggota'] != $anggotaData['id_anggota']) {
                return redirect()->to('/peminjaman')->with('error', 'Tidak diizinkan mengedit peminjaman orang lain');
            }
        }

        $data['peminjaman'] = $peminjaman;
        $data['buku'] = $this->buku->findAll();

UPDATE `peminjaman` SET `id_anggota` = '1', `id_petugas` = '1', `id_buku` = '3', `tanggal_pinjam` = '2026-10-05', `tanggal_kembali` = '2026-10-12', `status` = 'dipinjam'
WHERE `peminjaman`.`id_peminjaman` IN ('12')
---
            'status'          => $this->request->getPost('status'),
        ];

        $this->peminjaman->update($id, $data);