app/Controllers/Rak.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $data['rak'] = $this->rakModel
                ->like('nama_rak', $keyword)
                ->orLike('lokasi', $keyword)
                ->paginate(10);
        } else {
            $data['rak'] = $this->rakModel->paginate(10);
---
SELECT *
FROM `rak`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `rak`