app/Models/AnggotaModel.php

    public function getByUserId($user_id)
    {
        return $this->where('user_id', $user_id)->first();
---
SELECT *
FROM `anggota`
WHERE `user_id` = '5'
 LIMIT 1

    public function getAllWithUser()
    {
        return $this->select('anggota.*, users.nama')
            ->join('users', 'users.id = anggota.user_id')
            ->findAll();
---
SELECT `anggota`.*, `users`.`nama`
FROM `anggota`
JOIN `users` ON `users`.`id` = `anggota`.`user_id`