app/Models/PeminjamanModel.php

    public function getPeminjamanWithRelations($id = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('
            peminjaman.*,
            users.nama as nama_anggota,
            anggota.nis,
            buku.judul as judul_buku,
            petugas_user.nama as nama_petugas
        ');
        $builder->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota');
        $builder->join('users', 'users.id = anggota.user_id');
        $builder->join('buku', 'buku.id_buku = peminjaman.id_buku');
        $builder->join('petugas', 'petugas.id_petugas = peminjaman.id_petugas', 'left');
        $builder->join('users as petugas_user', 'petugas_user.id = petugas.user_id', 'left');

        if ($id) {
            $builder->where('peminjaman.id_peminjaman', $id);
            return $builder->get()->getRowArray();
---
SELECT `peminjaman`.*, `users`.`nama` as `nama_anggota`, `anggota`.`nis`, `buku`.`judul` as `judul_buku`, `petugas_user`.`nama` as `nama_petugas`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `users` ON `users`.`id` = `anggota`.`user_id`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
LEFT JOIN `petugas` ON `petugas`.`id_petugas` = `peminjaman`.`id_petugas`
LEFT JOIN `users` as `petugas_user` ON `petugas_user`.`id` = `petugas`.`user_id`
WHERE `peminjaman`.`id_peminjaman` = '12'