app/Models/PetugasModel.php

SELECT *
FROM `petugas`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function getByUserId($user_id)
    {
        return $this->where('user_id', $user_id)->first();

SELECT `petugas`.*, `users`.`nama`
FROM `petugas`
JOIN `users` ON `users`.`id` = `petugas`.`user_id`
---
    public function getAllWithUser()
    {
        return $this->select('petugas.*, users.nama')
            ->join('users', 'users.id = petugas.user_id')
            ->findAll();